# coding=utf-8
__author__ = 'tianchuang'


import jieba
import jieba.analyse
import pandas as pd

s11 = '谷物种植指以收获籽实为主，供人类食用的农作物的种植，如稻谷、小麦、玉米等农作物的种植。稻谷种植包括对下列稻谷的种植活动：—早籼稻：种用早籼稻、其他早籼稻；—晚籼稻：种用晚籼稻、其他晚籼稻；—中籼稻：种用中籼稻、其他中籼稻；—粳稻：种用粳稻、其他粳稻；—糯稻：种用糯稻、其他糯稻；—其他稻谷：稻谷壳、稻谷秸及其他未列明稻谷。小麦种植包括对下列小麦的种植活动：—硬质小麦：种用硬质小麦、其他硬质小麦；—软质小麦：种用软质小麦、其他软质小麦；—混合小麦：种用混合小麦、其他混合小麦；—其他小麦：麦秸及其他未列明小麦。玉米种植包括对下列玉米的种植活动：—白玉米：种用白玉米、其他白玉米；—黄玉米：种用黄玉米、其他黄玉米；—糯玉米：种用糯玉米、其他糯玉米；—甜玉米：种用甜玉米、其他甜玉米；—其他玉米：玉米秸及其他未列明玉米。其他谷物种植包括对下列谷物的种植活动：—谷子：硬谷子、糯谷子、其他谷子；—高粱：红粒高粱（种用红粒高粱、其他红粒高粱）、白粒高粱（种用白粒高粱、其他白粒高粱）、糯高粱（种用糯高粱、其他糯高粱）、其他高粱（其他种用高粱、其他未列明高粱）；—大麦：裸大麦（种用裸大麦、其他裸大麦）、皮大麦（种用皮大麦、其他皮大麦）；—燕麦：裸燕麦、皮燕麦；—黑麦；—荞麦：甜荞麦、苦荞麦；—作物茎、秆、根（部分）：稻草、谷壳、谷子秸、高粱秸；—其他谷物：莜麦、元麦、青稞、糜子（硬糜子、糯糜子）、黍子、紫米、薏苡、其他未列明谷物。'

s12='豆类、油料和薯类种植豆类种植包括对下列豆类的种植活动：—大豆：黄大豆、黑大豆、青大豆、褐红大豆、双青豆、青仁乌豆、小黑豆、其他大豆；—绿豆：明绿豆（种用明绿豆、其他明绿豆）、毛绿豆（种用毛绿豆、其他毛绿豆）；—小豆：红小豆、灰白小豆、狸小豆、其他小豆；—干豌豆：白豌豆（种用白豌豆、其他白豌豆）、绿豌豆（种用绿豌豆、其他绿豌豆）、麻豌豆（种用麻豌豆、其他麻豌豆）；—干蚕豆：种用干蚕豆、其他干蚕豆；—芸豆：种用芸豆、其他芸豆；—饭豆：种用饭豆、其他饭豆；—干豇豆：种用干豇豆、其他干豇豆；—鹰嘴豆：种用鹰嘴豆、其他鹰嘴豆；—豆类蔬菜（部分）：豌豆、蚕豆；—大豆秸；—其他杂豆：种用杂豆、其他未列明杂豆。油料种植包括对下列油料的种植活动：—花生：带壳花生（种用带壳花生、其他带壳花生）、花生仁；—油菜籽：双低油菜籽（种用双低油菜籽、其他双低油菜籽）、其他油菜籽（其他种用油菜籽、其他未列明油菜籽）；—葵花籽：油葵（种用油葵、其他油葵）、食葵（种用食葵、其他食葵）；—芝麻：白芝麻（种用白芝麻、其他白芝麻）、黑芝麻（种用黑芝麻、其他黑芝麻）、黄芝麻（种用黄芝麻、其他黄芝麻）；—胡麻籽：种用胡麻籽、其他胡麻籽；—棉籽：种用棉籽、其他棉籽；—蓖麻籽：种用蓖麻籽、其他蓖麻籽；—芥子：种用芥子、其他芥子；—红花籽：种用红花籽、其他红花籽；—罂粟子；—作物茎、秆、根（部分）：花生蔓、油菜籽秆、芝麻秆、向日葵秆；—其他油料。薯类种植包括对下列薯类的种植活动：—马铃薯：种用马铃薯、其他马铃薯；—木薯：鲜木薯、木薯干、其他木薯；—甘薯：种用甘薯、甘薯干、其他鲜甘薯；—薯藤；—其他薯类。'

s13='棉、麻、糖、烟草种植棉花种植包括对下列棉花的种植活动：—籽棉；—棉花秆；—其他棉花。麻类种植包括对下列麻类的种植活动：—生亚麻；—生苎麻；—生黄红麻；—生线麻；—生苘麻；—生大麻；—生剑麻；—麻秆；—其他生麻。糖料种植指用于制糖甘蔗和甜菜种植。包括对下列糖料的种植活动：—甘蔗；—甜菜；—其他糖料。烟草种植包括对下列烟草的种植活动：—未去梗烤烟叶；—未去梗晒烟叶；—未去梗晾烟叶；—未去梗白肋烟；—烟秆；—其他未加工烟草。'

s14='蔬菜、食用菌及园艺作物种植蔬菜种植包括对下列蔬菜的种植活动：—叶菜类蔬菜：芹菜、油菜、菠菜、苋菜、空心菜、香菜、茼蒿、小白菜、冬寒菜、木耳菜、茴香、其他叶菜类蔬菜；—白菜类蔬菜：大白菜、普通白菜、乌榻菜、菜心（菜薹）、紫菜薹；—芥菜类蔬菜：叶用芥菜、茎用芥菜、根用芥菜；—甘蓝类蔬菜：结球甘蓝、菜花、花椰菜、青花菜、抱子甘蓝、球茎甘蓝、芥蓝；—根茎类蔬菜：白萝卜、红萝卜、胡萝卜、水萝卜、生姜、榨菜头、芋头、百合、山药、牛蒡、魔芋、其他根茎类蔬菜；—瓜菜类蔬菜：黄瓜、冬瓜、西葫芦、苦瓜、南瓜、佛手瓜、丝瓜、瓠瓜、其他瓜类蔬菜；—豆类蔬菜：扁豆、干扁豆、荚豆、豇豆、四季豆、毛豆、其他豆类蔬菜；—茄果类蔬菜：茄子、青椒、辣椒、西红柿、其他茄果类蔬菜；—莴苣及菊苣类蔬菜：生菜、结球莴苣（包心生菜）、莴笋、其他莴苣及菊苣类蔬菜；—葱蒜类蔬菜：洋葱、大葱、细香葱、薤菜、大蒜、蒜苗、蒜苔、蒜头、韭菜、其他葱蒜类蔬菜；—水生蔬菜：莲藕、荸荠、慈姑、莼菜、水芹、菱角、茭白、其他水生蔬菜；—养植蔬菜及其他蔬菜：豌豆苗、豆芽菜、黄花、香椿、竹笋、芦笋、金针菜、黄秋葵、其他未列明蔬菜；—蔬菜籽。不包括：—用作水果的瓜果类种植，如西瓜、白兰瓜、香瓜等，列入（仁果类和核果类水果种植）、（葡萄种植）、（柑橘类种植）、（香蕉等亚热带水果种植）、（其他水果种植）、（坚果种植）、（含油果种植）等相关类别中。食用菌种植包括对下列食用菌的种植活动：—平菇；—金针菇；—双孢蘑菇；—鸡腿菇；—杏鲍菇；—茶树菇；—滑菇；—草菇；—猴头菌；—香菇；—竹荪；—黑木耳；—黄背木耳；—白木耳；—松茸；—榛蘑；—灰树花；—其他食用菌。不包括：—野生菌类的采集，分别列入（非木竹材林产品采集）。花卉种植包括对下列花卉的种植活动：—盆栽花：孤挺花、银莲花（鳞茎类）、美人蕉、窄叶小草、铃兰、藏红花、仙客来、大丽花、独尾草、小苍兰、盆栽贝母、雪花莲、大岩桐、风信子、鸢尾、观音兰、水仙头、水仙花、虎眼万年青、酢浆草、晚香玉、毛茛、茜草、老虎莲、郁金香、杜鹃、盆栽菊花、凤梨、兰花、一品红、花烛属、君子兰、秋海棠、伽兰菜、新几内亚凤仙、仙人掌及多浆植物、花坛花卉、木本盆花、其他盆栽花；—鲜切花及花蕾：康乃馨、满天星、勿忘我、玫瑰、情人草、紫罗兰、月季、香石竹、唐菖蒲、百合花、非洲菊、补血草、马蹄莲、火鹤、其他鲜切花及花蕾；—切叶：肾蕨、散尾葵、苏铁、富贵竹、龟背竹、其他切叶；—切枝：银芽柳、其他切枝；—干燥花；—花卉种球：唐菖蒲种球、百合种球、郁金香种球、水仙种球、马蹄莲种球、大丽花种球、美人蕉种球、风信子种球、小苍兰种球、球根鸢尾种球、晚香玉种球、其他花卉种球；—花卉种子：一串红种子、矮牵牛种子、万寿菊种子、凤仙花种子、鸡冠花种子、三色堇种子、金鱼草种子、石竹种子、翠菊种子、四季秋海棠种子、其他花卉种子；—花卉种苗：香石竹种苗、菊花种苗、非洲菊种苗、月季种苗、火鹤种苗、兰花种苗、君子兰种苗、其他花卉种苗。其他园艺作物种植指盆栽观赏花木，以及用于装饰等目的的植物的种植（如草坪、草皮等）。包括对下列园艺作物的种植活动：—园艺产品：盆栽观叶植物（龙血树、马拉巴栗、喜林芋、绿萝、变叶木、袖珍椰子、盆栽散尾葵、绿巨人、花叶万年青、竹芋、白鹤芋、花叶芋、亮丝草、其他盆栽观叶植物）、草皮、草坪、其他园艺产品；—草种：苜蓿草种、箭舌豌豆草种、红豆草草种、草木犀草种、燕麦草种、多花黑麦草草种、披碱草草种、柠挑草种、沙打旺草种、锦鸡儿草种、老芒麦草种、羊柴草种、其他草种；—其他盆景及园艺产品。不包括：—树木幼苗的培育和种植，列入（林木育种）、（林木育苗）；—城市草坪的种植、管理，列入（绿化管理）。'

s15='水果种植仁果类和核果类水果种植指苹果、梨、桃、杏、李子等水果种植。包括对下列仁果类和核果类水果的种植活动：—苹果：红富士苹果、国光苹果、秦冠苹果、香蕉苹果、金冠苹果、元帅苹果、新红星苹果、其他苹果；—梨：雪花梨、鸭梨、酥梨、香梨、苹果梨、黄冠梨、绿宝石梨、冬果梨、贡梨、黄花梨、其他梨；—核果类水果：桃、樱桃、枣、红果、山楂、李子、石榴、杏、杨梅；—水果籽（部分）：杏核等；—农户仁果类和核果类水果种植、加工一体的果酒及水果产品的生产。不包括：—野生水果的采集，列入（非木竹材林产品采集）。葡萄种植包括对下列葡萄的种植活动：—葡萄：巨峰葡萄、玫瑰香葡萄、白葡萄、龙眼葡萄、木纳格葡萄、红提葡萄、酿造葡萄、其他葡萄；—葡萄籽；—农户葡萄种植、加工一体的葡萄酒生产及葡萄产品加工。不包括：—野生水果的采集，列入（非木竹材林产品采集）。柑橘类种植包括对下列柑橘类的种植活动：—柑橘；—橙；—宽皮柑橘；—柚类；—金柑；—柚子；—柠檬；—其他柑橘类水果。不包括：—野生水果的采集，列入（非木竹材林产品采集）。香蕉等亚热带水果种植指香蕉、菠萝、芒果等亚热带水果种植。包括对下列亚热带水果的种植活动：—香蕉；—菠萝；—龙眼；—荔枝；—枇杷；—红毛丹；—芒果；—橄榄；—无花果；—鳄梨；—番石榴；—山竹果；—杨桃；—莲雾；—火龙果；—其他亚热带水果；—农户亚热带水果种植、加工一体的果酒及水果产品的生产。不包括：—野生水果的采集，列入（非木竹材林产品采集）。其他水果种植包括对下列水果的种植活动：—瓜类水果：西瓜、哈蜜瓜、华莱士瓜、香瓜、伊利沙白瓜、金瓜、木瓜、其他瓜类水果；—其他水果：柿子、草莓、黑莓、桑椹、猕猴桃、沙棘、其他未列明水果；—其他水果籽；—农户其他水果种植、加工一体的果酒及其他水果产品的生产。不包括：—野生水果的采集，列入（非木竹材林产品采集）。'

s16='坚果、含油果、香料和饮料作物种植坚果种植包括对下列坚果的种植活动：—椰子：种用椰子、其他椰子；—腰果；—核桃；—山核桃；—栗子：板栗、锥栗、丹东栗、其他栗子；—松子；—榛子；—阿月浑子果（开心果）；—槟榔；—白果；—香榧；—巴旦杏；—夏威夷果；—其他坚果；—农户坚果种植、加工一体的果酒及坚果产品的生产。不包括：—坚果的采集，列入（非木竹材林产品采集）。含油果种植指橄榄、油棕榈等的种植。包括对下列含油果的种植活动：—油棕果及油棕仁：种用油棕果及油棕仁、其他油棕果及油棕仁；—油橄榄果。不包括：—野生含油果的采集，列入（非木竹材林产品采集）。香料作物种植包括对下列香料作物的种植活动：—调味香料：花椒、胡椒、八椒、桂皮、桂花、丁香、豆蔻、小茴香、咖喱、枯茗子、蒿子、杜松果、其他调味香料；—香味料：香子兰、香茅草、薄菏油、留兰香、啤酒花、番红花、姜黄、麝香草、月桂叶、其他香味料。不包括：—香料的提取和制造等活动，列入（香料、香精制造）。茶及其他饮料作物种植包括对下列茶及其他饮料作物的种植活动：—茶叶：红茶、绿茶、白茶、黄茶、清茶（铁观音、乌龙茶、其他清茶）、黑茶（普洱茶、其他黑茶）、再加工茶（银杏茶、其他再加工茶、其他茶叶）；—其他饮料原料：可可豆、咖啡豆、其他未列明饮料原料。不包括：—茶叶的精加工，列入（精制茶加工）；—可可和咖啡的精加工，列入（固体饮料制造）。'

s17='中药材种植指主要用于中药配制以及中成药加工的药材作物的种植。包括对下列中药材的种植活动：—各种中草药材：甘草、人参、古柯叶、罂粟秆、当归、田七、党参、黄连、菊花、冬虫夏草、贝母、川芎、半夏、白芍、天麻、黄芪、大黄、籽黄、白术、地黄、槐米、杜仲、茯苓、枸杞、大海子、沉香、沙参、青蒿、鱼藤根、除虫菊、灵芝、五味子、刺五加、生地、麦冬、云木香、白芷、元胡、山茱萸、莲翘、辛荑、厚朴、黄芩、葛根、柴胡、麻黄、列当、肉苁蓉、锁阳、罗布麻、其他中草药材。不包括：—用于杀虫和杀菌目的植物的种植，列入（其他农业）。'

s19='其他农业指上述未列明的农作物种植。包括用于杀菌和杀虫作物的种植，以及染料作物、绿肥作物、饲料作物、水生植物种植和野生植物采集。包括对下列其他农业作物的种植活动：—苜蓿；—青饲料；—饲料牧草：苜蓿干草、羊草、沙打旺、其他饲料牧草；—饲料作物用种子；—其他饲料作物；—芦苇；—席草；—苇子；—莲子；—蒲草；—慈姑；—其他水生植物类；—其他作物茎、杆、根；—其他农作物副产品。不包括：—野生林产品的采集，列入（非木竹材林产品采集）；—中药材的种植，列入（中药材种植）。'

tags11=jieba.analyse.extract_tags(s11, topK=50, withWeight=False, allowPOS=('n'))
tags12=jieba.analyse.extract_tags(s12, topK=50, withWeight=False, allowPOS=('n'))
tags13=jieba.analyse.extract_tags(s13, topK=50, withWeight=False, allowPOS=('n'))
tags14=jieba.analyse.extract_tags(s14, topK=50, withWeight=False, allowPOS=('n'))
tags15=jieba.analyse.extract_tags(s15, topK=50, withWeight=False, allowPOS=('n'))
tags16=jieba.analyse.extract_tags(s16, topK=50, withWeight=False, allowPOS=('n'))
tags17=jieba.analyse.extract_tags(s17, topK=50, withWeight=False, allowPOS=('n'))
tags19=jieba.analyse.extract_tags(s19, topK=50, withWeight=False, allowPOS=('n'))

print('011:谷物种植:')
print(",".join(tags11))

print('012:豆类、油料和薯类种植:')
print(",".join(tags12))

print('013:棉、麻、糖、烟草种植:')
print(",".join(tags13))

print('014:蔬菜、食用菌及园艺作物种植:')
print(",".join(tags14))

print('015:水果种植:')
print(",".join(tags15))

print('016:坚果、含油果、香料和饮料作物种植:')
print(",".join(tags16))

print('017:中药材种植:')
print(",".join(tags17))

print('019:其他农业:')
print(",".join(tags19))

d11 = pd.DataFrame(columns=['describe'])
d12 = pd.DataFrame(columns=['describe'])
d13 = pd.DataFrame(columns=['describe'])
d14 = pd.DataFrame(columns=['describe'])
d15 = pd.DataFrame(columns=['describe'])
d16 = pd.DataFrame(columns=['describe'])
d17 = pd.DataFrame(columns=['describe'])
d19 = pd.DataFrame(columns=['describe'])


i=0
for item in tags11:

    d11.loc[i]=None
    d11['describe'].loc[i]=item
    i+=1

i=0
for item in tags12:

    d12.loc[i]=None
    d12['describe'].loc[i]=item
    i+=1

i=0
for item in tags13:

    d13.loc[i]=None
    d13['describe'].loc[i]=item
    i+=1

i=0
for item in tags14:

    d14.loc[i]=None
    d14['describe'].loc[i]=item
    i+=1

i=0
for item in tags15:

    d15.loc[i]=None
    d15['describe'].loc[i]=item
    i+=1

i=0
for item in tags16:

    d16.loc[i]=None
    d16['describe'].loc[i]=item
    i+=1

i=0
for item in tags17:

    d17.loc[i]=None
    d17['describe'].loc[i]=item
    i+=1

i=0
for item in tags19:

    d19.loc[i]=None
    d19['describe'].loc[i]=item
    i+=1

print(d11.describe())
print(d12.describe())
print(d13.describe())
print(d14.describe())
print(d15.describe())
print(d16.describe())
print(d17.describe())
print(d19.describe())



d2 = pd.DataFrame(columns=['describe','freq'])

i=0
for item in d11['describe']:
    print (item)
    d2.loc[i]=None
    d2['describe'].loc[i]=item
    i+=1

for item in d12['describe']:
    d2.loc[i]=None
    d2['describe'].loc[i]=item
    i+=1

for item in d13['describe']:
    d2.loc[i]=None
    d2['describe'].loc[i]=item
    i+=1

for item in d14['describe']:
    d2.loc[i]=None
    d2['describe'].loc[i]=item
    i+=1

for item in d15['describe']:
    d2.loc[i]=None
    d2['describe'].loc[i]=item
    i+=1

for item in d16['describe']:
    d2.loc[i]=None
    d2['describe'].loc[i]=item
    i+=1

for item in d17['describe']:
    d2.loc[i]=None
    d2['describe'].loc[i]=item
    i+=1

for item in d19['describe']:
    d2.loc[i]=None
    d2['describe'].loc[i]=item
    i+=1

d2['freq']=1

d2=d2.groupby(['describe'],as_index=False).sum()
print (d2)
print (d2.describe())

print (d2[d2['freq']>1])
